[
    {
        "hyperlinks": [
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/default.aspx",
            "http://spacemice.org/index.php?title=Cadman",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/default.aspx",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/contact.aspx",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/acknowledgements.aspx",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/browse.aspx",
            "3DCad_Brochure.pdf"
        ],
        "title": "3Dconnexion CadMan 3D Motion Controller",
        "company": "3Dconnexion",
        "year": 2003,
        "primaryKey": "Joystick",
        "secondaryKey": "Blank",
        "attribute": "Isometric",
        "originalPrice": 399,
        "degreesOfFreedom": 6,
        "dimensions": {
            "dim_length": 175,
            "dim_width": 122,
            "dim_height": 43,
            "dim_unit": "mm"
        },
        "shortDescription": "The CadMan is a 6 degree of freedom (DOF) joystick controller. It represented a significant step towards making this class of is controller affordable. It was mainly directed at 3D modelling and animation and was a “next generation” of the Magellan controller, which is also in the collection.",
        "longDescription": "The CadMan is a 6 degree of freedom (DOF) joystick controller. It represented a significant step towards making this class of is controller more affordable. It was mainly directed at 3D modelling and animation and was a “next generation” of the Magellan/SpaceMouse controller, which is also in the collection. Like the Magellan, this is an isometric rate-control joystick. That is, it rests in a neutral central position, not sending and signal. When a force is applied to it, it emits a signal indicating the direction and strength of that force. This signal can then be mapped to a parameter of a selected object, such as a sphere, and – for example – cause that sphere to rotate for as long as, and as fast as, and in the direction determined by, the duration, force, and direction of the applied force. When released, it springs back to neutral position. Note that the force does not need to be directed along a single DOF. In fact, a core feature of the device is that one can simultaneously and independently apply force that asserts control over more than one DOF, and furthermore, vary those forces dynamically. As an aid to understanding, let me walk through some of the underlying concepts at play here by using a more familiar device: a computer mouse. If you move a mouse in a forward/backward direction, the mouse pointer on the screen moves between the screen’s top and bottom. If you think of the screen as a piece of graph paper, that corresponds to moving along the “Y” axis. That is one degree of freedom. On the other hand, you could move the mouse left and right, which causes the mouse to move between the left and right side of the screen. That would correspond to moving along the graph paper’s “X” axis – a second degree of freedom. Yet, you can also move the mouse diagonally. This is an example of independently controlling two degrees of freedom. Now imagine that if you lifted your mouse off your desktop, that your computer could dynamically sense its height as you did so. This would constitute a “flying mouse” (the literal translation of the German word for a “Bat”, which Canadian colleague, Colin Ware, applied to just such a mouse which he built in 1988). If you moved your Bat vertically up and down, perpendicular to the desktop, you would be controlling movement along the “Z” axis - a third degree of freedom. Having already seen that we can move a mouse diagonally, we have established that we need not be constrained to only moving along a single axis. That extends to the movement of our Bat and movement along the “Z” axis. We can control our hand movement in dependently in any or all directions in 3D space. But how does one reconcile the fact that we call the CadMan a “3D controller, and yet also describe it as having 6 degrees of freedom? Yes, as described, our bat can fly in 3D, but on the other hand, its range of movement within those 3 dimensions is much richer. To demonstrate this, move your hand in 3D space on and above your desktop. However, do so keeping your palm flat, parallel to the desktop with your fingers pointing directly forward. In so doing, you are still moving in 3D. Now, while moving, twist your wrist, while moving the hand, such that your palm is alternatively exposed to the left and right side. This constitutes rotation around the “Y” axis. A fourth DOF. Now add a waving motion to your hand, as if it were a paper airplane diving up and down, while also rocking left and right. But keep your fingers pointing forward. You have now added a fifth DOF, rotation around the “X” axis. Finally, add a twist to your wrist so that your fingers are no longer constrained to pointing forward. This is the sixth degree of freedom, rotation around the “Z” axis. Now don’t be fooled, this exercise could continue. We are not restricted to even six DOF. Imagine doing the above, but where the movement and rotations are measured relative to the Bat’s position and orientation, rather than to the holding/controlling hand, per se. One could imagine the Bat having a scroll wheel, like the one on most mice today. Furthermore, while flying your Bat around in 3D, that wheel could easily be rolled in either forward or backward, and thereby control the size of whatever was being controlled. Hence, with one hand we could assert simultaneous and independent control over 7 DOF in 3D space. This exercise has two intended take-aways. The first is a better working understanding between the notion of Degree of Freedom (DOF) and Dimension in space. Hopefully, the confusion frequently encountered when 3D and 6DOF are used in close context, can now be eliminated. Second, is that, with appropriate sensing, the human hand is capable of exercising control over far more degrees of freedom that six. And if we use the two hands together, the potential number of DOF that one can control goes even further. Finally, it is important to add one more take-away – one which both emerges from, and is frequently encountered when discussing, the previous two. That is, do not equate exercising simultaneous control over a high number of DOF with consciously doing the same number of different things all at once. The example that used to be thrown at me when I started talking about coordinated simultaneously bi-manual action went along the lines of, “Psychology tells us that we cannot do multiple things at once, for example, simultaneously tapping your head and rubbing your stomach. ”Well, first, I can tap my head with one hand while rubbing my stomach with the other. But that is not the point. The whole essence of skill – motor-sensory and cognitive – is “chunking” or task integration. When one appears to be doing many different things at once, if they are skilled, they are consciously doing only one thing. Playing a chord on the piano, for example, or skiing down the hill. Likewise, in flying your imaginary BAT in the previous exercise with the scroll wheel, were you doing 7 things at once, or one thing with 7 DOF? And if you had a Bat in each hand, does that mean you are now doing 14 things at once, or are you doing one thing with 14 DOF? Let me provide a different way of answering this question: if you have ever played air guitar, or “conducted” the orchestra that you are listening to on the radio, you are exercising control over more than 14 DOF. And you are doing exactly what I just said, “playing air guitar” or “conducting an orchestra”. One thing – at the conscious level, which is what matters – despite almost any one thing being able to be deconstructed into hundreds of sub-tasks. As I said the essence of skill: aggregation, or chunking. What is most important for both tool designers and users to be mindful of, is the overwhelming influence that our choice and design of tools impacts the degree to which such integration or chunking can take place. The degree to which the tool matches both the skills that we have already acquired through a lifetime of living in the everyday world, and the demands of the intended task, the more seamless that task can be performed, the more “natural” it will feel, and the less learning will be required. In my experience, it brought particular value when used bimanually, in combination with a mouse, where the preferred hand performed conventional pointing, selection and dragging tasks, while the non-preferred hand could manipulate the parameters of the thing being selected. First variation of the since the 2001 formation of 3Dconnextion. The CadMan came in 5 colours: smoke, orange, red, blue and green. See the notes for the LogiCad3D Magellan for more details on this class of device. It is the “parent” of the CadMan, and despite the change in company name, it comes from the same team.",
        "__images": [
            "http://localhost:1050/files/images/buxton/upload_00922c20-c075-4a57-bbd2-b8089371b4da.png",
            "http://localhost:1050/files/images/buxton/upload_4b9676f8-ee6c-4a8c-9bd1-aa169bfdbe72.png",
            "http://localhost:1050/files/images/buxton/upload_33aefb23-7e0e-4319-85e3-5154ab85fd53.png"
        ],
        "captions": [
            "The 3Dconnexion CadMan 3D Motion Controller, a 6DOF joystick.",
            "Brochure for the CadMan 3D Motion Controller.(Click on image to access full document.)"
        ],
        "fileNames": [
            "3DCad_0410.JPG",
            "3DCad_Brochure.jpg"
        ]
    },
    {
        "hyperlinks": [
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/acknowledgements.aspx",
            "SpaceNavigator_Press_Release.pdf",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/browse.aspx",
            "https://web.archive.org/web/20061205222533/http://www.3dconnexion.com:80/products/3a1d.php",
            "3DConnexion_SpaceNavigator/SpaceNavigator_Launch_Web_Page.pdf",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/default.aspx",
            "https://www.pcmag.com/article2/0,2817,2082798,00.asp",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/default.aspx",
            "SpaceNavigator_Launch_Web_Page.pdf",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/contact.aspx",
            "Navigator_Data_Sheet_2006.pdf",
            "3DConnexion_SpaceNavigator/SpaceNavigator_Press_Release.pdf"
        ],
        "title": "3Dconnexion SpaceNavigator ",
        "company": "3Dconnexion",
        "year": 2006,
        "primaryKey": "Joystick",
        "secondaryKey": "Dial",
        "attribute": "Isometric",
        "originalPrice": 59,
        "degreesOfFreedom": 6,
        "dimensions": {
            "dim_length": 78,
            "dim_width": 78,
            "dim_height": 53,
            "dim_unit": "mm"
        },
        "shortDescription": "The SpaceNavigator is an entry level 6DOF joystick for the interactive 3D market. It came in a “Personal” and “Standard” edition, at $59. 00 and $99. 00 USD, respectively. These were break-through prices which opened up this technology (which cost $1, 595. 00 in 1991) to gamers and consumers. Doing so was necessary, since the high-end professional 3D graphics market was relatively small, and not growing anywhere near as fast as the consumer and gaming market.",
        "longDescription": "The SpaceNavigator is an entry level 6DOF joystick for the interactive 3D market. It came in a “Personal” and “Standard” edition, at $59. 00 and $99. 00 USD, respectively. These were break-through prices which opened up this technology (which cost $1, 595. 00 in 1991) to gamers and consumers. Doing so was necessary, since the high-end professional 3D graphics market was relatively small, and not growing anywhere near as fast as the consumer and gaming market. As illustrated in an accompanying image, the direction of the force which controls each of the 6 degrees of freedom of the SpaceNavigator are: Move Left-Right: Push/Pull left-right parallel to the desktop. Move Forward-Backward: Push/Pull forward-backward parallel to the desktop. Move Vertically, Up-Down: Push down vertically into the table or pull up vertically away from the tableTilt Left-Right: Tilt the joystick left-rightTilt Forward-Backward: Tilt joystick forward-backwardRotate around vertical axis: Twist the joystick clockwise or counter clockwise. Control of these 6 DOF can be combined. For example, you can rotate/roll right while spinning. Besides gaming, one of the hopes was that this device would be used in interacting with 3D programs like Google Earth. The problem was, however, that there were few such programs then, just as now, relatively speaking, and even Google Earth, while remarkable, is not used anywhere as frequently of 2D Google Maps, for example. For those of us in the 3D graphics market, it was fantastic with respect to animation, games and industrial design. But it never took off, no matter how seductive it was. And, the interesting question is, will VR and AR change that? And if so, how will this class of 6DOF device play in that market?",
        "__images": [
            "http://localhost:1050/files/images/buxton/upload_b198c728-2402-4c85-888e-636f7a631f58.jpg",
            "http://localhost:1050/files/images/buxton/upload_4bf3af7c-2fd1-44fc-9cbb-f2e4019880ff.png",
            "http://localhost:1050/files/images/buxton/upload_2193297f-a574-4e34-8987-650d2aa16074.png",
            "http://localhost:1050/files/images/buxton/upload_768bc0c9-eabc-4a99-8302-6688a9d26339.jpg",
            "http://localhost:1050/files/images/buxton/upload_fdd2a51f-988d-4a3a-96af-76dfd5811700.png",
            "http://localhost:1050/files/images/buxton/upload_d0fc032b-c252-4f97-994d-7e7d4731d6e3.png",
            "http://localhost:1050/files/images/buxton/upload_a78d704f-7e84-4338-915b-a3bf22b00ee3.png"
        ],
        "captions": [
            "The 3Dconnexion SpaceNavigator 6DOF Joystick.",
            "The 3Dconnexion SpaceNavigator adjacent to ruler in order to show scale.",
            "Diagram from SpaceNavigator Data Sheet illustrating the directions of force which control each of the 6DOF.",
            "Page 1 of the SpaceNavigarot Data Sheet.(Click on image to access full document.)",
            "A page from the launch web site of the SpaceNavigator.(Click on image to access full document.)",
            "Front page of the press release announcing the launch of the SpaceNavigator.(Click on image to access full document.)"
        ],
        "fileNames": [
            "SpaceNavigator_01.JPG",
            "SpaceNavigator_02.JPG",
            "SpaceNavigator_Control_Axes.jpg",
            "Navigator_Data_Sheet_2006.jpg",
            "SpaceNavigator_Launch_Web_Page.jpg",
            "SpaceNavigator_Press_Release.jpg"
        ]
    },
    {
        "hyperlinks": [
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/default.aspx",
            "SpaceMouse_Plus_Data_Sheet.pdf",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/default.aspx",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/contact.aspx",
            "http://youtu.be/w5OH3EfeL64",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/acknowledgements.aspx",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/browse.aspx",
            "SpaceMouse_Plus_Info_Sheet.pdf"
        ],
        "title": "3Dconnexion Magellan/SpaceMouse Plus",
        "company": "3Dconnexion",
        "year": 1998,
        "primaryKey": "Joystick",
        "secondaryKey": "Blank",
        "attribute": "Isometric",
        "originalPrice": 745,
        "degreesOfFreedom": 6,
        "dimensions": {
            "dim_length": 188,
            "dim_width": 120,
            "dim_height": 44,
            "dim_unit": "mm"
        },
        "shortDescription": "The Magellan/SpaceMouse Plus is a refinement of the original LogiCad3D Magellan. From the industrial design perspective, the main difference is the switch from the original round “hockey puck” shaped handle to this asymmetric one.",
        "longDescription": "The Magellan Plus (also known as the Spacemouse Plus) is a refinement of the original LogiCad3D Magellan (LogiCad3D evolved into 3DConnexion). From the industrial design perspective, the main difference between the two is the switch from the round “hockey puck” shaped handle to this asymmetric one. Despite this rather small change, both are included in the collection since that small change is a good example of my axiom that “everything being best for something and worst for something else. ” One of the things which most attracted me to the original Magellan was its hockey-puck shaped handle. The reason is that in my mind, it shouted out, “jog-shuttle wheel”. That is, the kind of controller that I was familiar with from editing audio and video. Since we were building software for 3D animation, the shape had value as a physical icon, or “phycon”, whose affordances suggested how this new control could employ existing skills. That is the good side. On the other hand, for 3D manipulation, when gripped, that same symmetry lacked any immediate tactile feed-forward as to orientation. That is, what axis of the 3D model would be affected by tilting the handle in any direction. On the other hand, the new asymmetric handle told the user, through touch, how the orientation of the handle aligned with that of the 3D model being controlled. One of the key habits leading to design literacy is to constantly prospect for patterns, rather than just individual examples. The reg the pattern means that one can separate the superficial features of the example, and see the underlying issue. For example, compare the Magellan Plus and the LogiCad3D Magellan, respectfully, with any Apple mouse and the 1988 Apple iMac G3 “hockey puck” mouse. While mice and 3D joysticks are very different devices, the two pairings reflect the same pattern. The suggested lesson is that patterns suggest that certain things are not mere exceptions – they are something which will likely reoccur, and therefore something that one can learn from – as long as one can recognize the deep pattern hidden beneath the superficial exterior.",
        "__images": [
            "http://localhost:1050/files/images/buxton/upload_b8f75e72-88d6-4eb2-a959-e1160aa131fb.jpg",
            "http://localhost:1050/files/images/buxton/upload_50a49d85-3457-4b3a-a881-8fac9df87294.png",
            "http://localhost:1050/files/images/buxton/upload_2c1c2cbc-2635-4d58-a8ce-c9bcd86b0b0a.png",
            "http://localhost:1050/files/images/buxton/upload_dbc7fc18-3b56-488c-8a7c-a5dc3b113758.png",
            "http://localhost:1050/files/images/buxton/upload_c99ed453-5c3c-47f4-8699-122c9dcd2b68.png"
        ],
        "captions": [
            "Overview of the Magellan Plus.",
            "Overview of Magellan Plus in different colour.",
            "Page one of the Magellan Plus / SpaceMouse Plus Data Sheet.(Click on image to access full document.)",
            "Page one of the Magellan Plus / SpaceMouse Plus Information Sheet.(Click on image to access full document.)"
        ],
        "fileNames": [
            "3DPlus_0396.JPG",
            "3DPlus_0391.JPG",
            "SpaceMouse_Plus_Data_Sheet.jpg",
            "SpaceMouse_Plus_Info_Sheet.jpg"
        ]
    },
    {
        "hyperlinks": [
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/default.aspx",
            "http://www.evermotion.org/tutorials/show/7916/3dconnexion-s-spaceball-5000-review",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/default.aspx",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/contact.aspx",
            "SpaceBall_5000_Data_Sheet.pdf",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/acknowledgements.aspx",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/browse.aspx",
            "SP_SB_SM_Feature_Comparison_001.pdf"
        ],
        "title": "3Dconnexion Spaceball 5000",
        "company": "3Dconnexion",
        "year": 2003,
        "primaryKey": "Joystick",
        "secondaryKey": "Blank",
        "attribute": "Isometric",
        "originalPrice": 499,
        "degreesOfFreedom": 6,
        "dimensions": {
            "dim_length": 213,
            "dim_width": 76,
            "dim_height": 152,
            "dim_unit": "mm"
        },
        "shortDescription": "This is an improved version of the original 1991 SpaceBall, manufactured by SpaceBall Technologies. It is a good example of how products improve as the market grows, while the price goes down. The original model sold for $1, 595. 00 USD, while this for $499. 00.",
        "longDescription": "This is an improved version of the original 1991 SpaceBall, manufactured by SpaceBall Technologies. It is a good example of how products improve as the market grows, while the price goes down. The original model sold for $1, 595. 00 USD, while this for $499. 00. This version of the SpaceBall illustrates how the form-factor of the original version has changed over time. There are now 12 programmable function keys, 9 to be operated by the fingers on one side, and 3 to be operated by the thumb on the other. Note how the button placement indicates that the device is intended to be used by the left hand, with an accompanying mouse by the right – that is, by being meant for the left hand, it is intended for a right handed person.",
        "__images": [
            "http://localhost:1050/files/images/buxton/upload_355160fb-24fa-4af5-be41-14a426dbb201.jpg",
            "http://localhost:1050/files/images/buxton/upload_0a51e767-d942-4ad5-b97d-8bcd97262c5e.png",
            "http://localhost:1050/files/images/buxton/upload_0ec8eb67-bcc1-4664-9053-0eab6ced15da.png",
            "http://localhost:1050/files/images/buxton/upload_0d8559fd-2db2-4bf2-bc17-ed8c949b17fe.png",
            "http://localhost:1050/files/images/buxton/upload_043a225c-d19d-461d-a8cd-4b962d9e7eec.jpg",
            "http://localhost:1050/files/images/buxton/upload_a66f756a-3d89-4ea8-ac32-b144971145c4.jpg",
            "http://localhost:1050/files/images/buxton/upload_add2c0db-3fa7-4c36-8226-a6df1f6d0d33.jpg"
        ],
        "captions": [
            "Side view of the Spaceball 5000.",
            "Upper-left view of the Spaceball 5000, showing the position of 9 of the 12 programable buttons.",
            "Back view of the Spaceball 5000, showing the position of buttons on either side of the ball.",
            "View showing bimanual use, with the SpaceBall in the left hand, mouse in right.  Note position of buttons relative to thumb and fingers.",
            "Caption to come.(Click on image to access full document.)",
            "Page 1 of SpaceBall 5000 Date Sheet.(Click on image to access full document.)"
        ],
        "fileNames": [
            "3DSpace_5000_01.JPG",
            "3DSpace_5000_02.JPG",
            "3DSpace_5000_05.JPG",
            "3DSpace_5000_06.JPG",
            "SP_SB_SM_Feature_Comparison.jpg",
            "SpaceBall_5000_Data_Sheet.jpg"
        ]
    },
    {
        "hyperlinks": [
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/default.aspx",
            "https://web.archive.org/web/20070104202529/http://solutions.3m.com:80/wps/portal/3M/en_US/ergonomics/home/products/ergonomicmouse/",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/default.aspx",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/contact.aspx",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/acknowledgements.aspx",
            "3M_2006_Catalogue.pdf",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/browse.aspx",
            "https://web.archive.org/web/20070106100452/http://solutions.3m.com/wps/portal/3M/en_US/ergonomics/home/products/ergonomicmouse/factsheet/"
        ],
        "title": "3M EM500 Ergonomic Mouse",
        "company": "3M",
        "year": 2006,
        "primaryKey": "Mouse",
        "secondaryKey": "Blank",
        "attribute": "Blank",
        "originalPrice": 72.5,
        "degreesOfFreedom": 2,
        "shortDescription": "Despite its form-factor suggesting that this is a joystick, it is actually a mouse. Ergonomic concerns drove this design. It forces the hand to assume a “thumb up” posture of the hand. This in turn reduces constriction of blood-flow through the relatively narrow channel of the wrist and reduces tension in the forearm. The compromise of this, however, is that one loses some fine-motion control which might otherwise have been possible using the fingers, rather than relying more on the wrist and forearm.",
        "longDescription": "Despite its form-factor suggesting that this is a joystick, it is actually a mouse. Ergonomic concerns drove this design. It forces the hand to assume a “thumb up” posture of the hand. This in turn reduces constriction of blood-flow through the relatively narrow channel of the wrist and reduces tension in the forearm. The joystick also came in two sizes so as to better accommodate different hand sizes. There almost always trade-offs in design. Often more than one. In this case, one compromise is a loss of some fine-motion control which might otherwise have been possible using the fingers, rather than relying more on the wrist and forearm. Another is the increased time/attention required when moving from the keyboard to the mouse. To do a simple test, move your hand to a conventional mouse. Now place a water glass which is taller than it is wide in the same position as the mouse, and compare how fast you can get it “in hand” enough to control its movement as well as you could the mouse. Try the same thing while not looking – using motor memory. Then consider how often you make that change. And, by the same token, consider how many different ways you can hold your mouse while still using it, versus a joystick shaped mouse with the button on top. In none of this am I complaining about, nor criticizing this mouse design. Rather, I am trying to illustrate that there is a lot to consider, and as either a designer or consumer, these are things to train oneself to notice and question. From such experience emerges the basis for better choices in both design and purchase. .",
        "__images": [
            "http://localhost:1050/files/images/buxton/upload_4cc93668-45b7-4f35-83c9-2cfada03300e.jpg",
            "http://localhost:1050/files/images/buxton/upload_71c323ff-df55-45ff-b521-70870fe90806.jpg",
            "http://localhost:1050/files/images/buxton/upload_2a0a83ab-a6a6-4c10-9685-a5ffaa515424.jpg",
            "http://localhost:1050/files/images/buxton/upload_ce18f53f-8ed4-462b-aa6b-9b12581ea723.jpg",
            "http://localhost:1050/files/images/buxton/upload_9cb28ff1-526c-4fdf-8f01-31636faee9e5.jpg",
            "http://localhost:1050/files/images/buxton/upload_9e0b772c-3963-4d52-a201-08d2d7e3d0a6.jpg"
        ],
        "captions": [
            "A view of the 3M Ergonomic Mouse in the grasp of the right hand, with the thumb activating the button at the top of the stem.",
            "A view of the 3M Ergonomic Mouse standing alone.",
            "EM500 Ergonomic web page, Jan, 2007",
            "EM500 Ergonomic Mouse Fact Sheet from 3M web site, Jan, 2007",
            "Entry for the EM500 Ergonomic Mouse in the 2006 3M catalogue, p. 18.(To access full document, click on image.)"
        ],
        "fileNames": [
            "3MErgo_01.JPG",
            "3MErgo_02.JPG",
            "3MErgo_Web_Jan_2007.JPG",
            "3MErgo_Web_Fact Sheet_Jan_2007.jpg",
            "3M_2006_Catalogue_p18.jpg"
        ]
    },
    {
        "hyperlinks": [
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/default.aspx",
            "Abaton_ProPoint_Brochure.pdf",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/default.aspx",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/contact.aspx",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/acknowledgements.aspx",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/browse.aspx"
        ],
        "title": "Abaton ProPoint Optical Trackball",
        "company": "Abaton",
        "year": 1989,
        "primaryKey": "Trackball",
        "secondaryKey": "Blank",
        "attribute": "Blank",
        "originalPrice": 140,
        "degreesOfFreedom": 2,
        "shortDescription": "A relatively early trackball for the Apple Macintosh computer. Note the positioning of the buttons, which bias the device for right-handed use, and using the thumb for the buttons and fingers for manipulating the ball.",
        "longDescription": "A relatively early trackball for the Apple Macintosh computer. The larger button was functionally equivalent to the mouse button, and the smaller one was a ‘lock’ button. The lock button is analogous to the SHIFT LOCK or CAPS LOCK on a QWERTY keyboard: With the keyboard, it means that one does not have to hold the SHIFT key down while typing a string of upper-case characters. With the trackball, it means that you don’t have to hold the primary “mouse” button down while rolling the trackball. The need that this meets can be easily be seen if one compares the relative difficulty of drawing a line by moving a mouse while holding down its button, compared to doing the same task with a trackball. With the mouse, the wrist and forearm mainly move the mouse, and the fingers are used to hold it, as well as the button. With the trackball, the fingers are engaged in rolling the ball as well as holding the button. Hence, the probability of task interference is high, just as with typing a string of upper-case characters on a keyboard without a SHIFT LOCK key. Next, in looking at trackballs, pay attention to the position of the buttons relative to the trackball itself. How this relationship varies across devices and says a lot about how the designers envisioned the device being used. For example, the relationship may indicate the design intends for the thumb or fingers to operate the ball. How does the relationship impact the device’s ability to accommodate left and right hand usage equally well? This latter point is especially important when the trackball is used simultaneously with a mouse. An example would be if the trackball was used to scroll a spreadsheet up-down / left-right, while the mouse was used to point, select, and/or drag. In this case, for example, the trackball would usually be operated by the non-dominant hand and the mouse by the dominant one. Yet, when used alone, the same user would typically operate the trackball with the dominant hand. The lesson from this example is the recognition that handedness is a factor of use (one vs two handed), not just a factor of whether the user’s left or right hand is dominant.",
        "__images": [
            "http://localhost:1050/files/images/buxton/upload_d10032c1-ce14-455c-8c87-2bc3f33c80f4.jpg",
            "http://localhost:1050/files/images/buxton/upload_9ae3794f-891c-4d69-976b-0f4731e18a0c.jpg",
            "http://localhost:1050/files/images/buxton/upload_6f658d8a-a0cb-4239-b4da-0fdec4438e5b.jpg",
            "http://localhost:1050/files/images/buxton/upload_95e565fe-e237-49b0-b5b7-c1ee8f0e9bb6.jpg",
            "http://localhost:1050/files/images/buxton/upload_476ac1b1-7ea1-4bd7-ae6f-dba0d323c631.jpg",
            "http://localhost:1050/files/images/buxton/upload_d5aaee4b-60b0-40c4-a59d-b2077c8982f6.jpg",
            "http://localhost:1050/files/images/buxton/upload_021aa857-5c1f-428b-92d1-a393fb507a22.jpg"
        ],
        "captions": [
            "An upper-left view of the Abaton ProPoint trackball.",
            "Left side view of the Abaton ProPoint trackball showing the Apple Desktop Bus (ADB) socket.",
            "Front-side view of the Abaton ProPoint trackball..",
            "Back-side view of the Abaton ProPoint trackball.",
            "Bottom view of the Abaton ProPoint trackball showing the serial number, etc.",
            "View of the Abaton ProPoint with the trackball removed.  The two shaft encoders that sense rotation in X and Y, respectively can be seen.",
            "First page of the Abatron ProPoint Trackball product sheet.(Click on image to access full document.)"
        ],
        "fileNames": [
            "Abaton_0105.JPG",
            "Abaton_0098.JPG",
            "Abaton_0099.JPG",
            "Abaton_0100.JPG",
            "Abaton_0103.JPG",
            "Abaton_0106.JPG",
            "Abaton_ProPoint_Brochure.jpg"
        ]
    },
    {
        "hyperlinks": [
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/browse.aspx",
            "Active_Book_Brochure.pdf",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/default.aspx",
            "http://www.computinghistory.org.uk/det/21617/Active-Book-Prototype-Circuit-Boards/",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/contact.aspx",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/acknowledgements.aspx"
        ],
        "title": "Active Book Company Active Book Prototype",
        "company": "Active Book Company",
        "year": 1991,
        "primaryKey": "Computer",
        "secondaryKey": "Blank",
        "attribute": "Prototype",
        "originalPrice": "NFS",
        "degreesOfFreedom": 2,
        "shortDescription": "This device is a prototype pen computer, The Active Book, which was developed in Cambridge, UK, by The Active Book Company. It had a strong focus on user experience, and like the equally ill-fated Momenta pen computer, was implemented using the pioneering object-oriented language Smalltalk. At about the time that this working prototype was built, near going into production, the company was bought and merged with EO, and the Active Book never went into production. This is an exceptionally rare piece of the history of pen computing.",
        "longDescription": "This device is a prototype pen computer, The Active Book, which was developed in Cambridge, UK, by The Active Book Company. It had a strong focus on user experience, and like the equally ill-fated Momenta pen computer, was implemented using the pioneering object-oriented language Smalltalk. At about the time that this working prototype was built, near going into production, the company was bought and merged with EO, and the Active Book never went into production. This is an exceptionally rare piece of the history of pen computing. .",
        "__images": [
            "http://localhost:1050/files/images/buxton/upload_e3e9f737-e3a8-4fbb-9fd8-07c396a40d50.jpg",
            "http://localhost:1050/files/images/buxton/upload_610bf6ca-807f-4eca-9a30-887bed74aa26.png"
        ],
        "captions": [
            "View of the Active Book prototype.",
            "Front page of the Active Book brochure.(Click on image to access full document.)"
        ],
        "fileNames": [
            "Active_1206.JPG",
            "Active_Book_Brochure_p1.jpg"
        ]
    },
    {
        "hyperlinks": [
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/default.aspx",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/contact.aspx",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/acknowledgements.aspx",
            "https://web.archive.org/web/20030621224236/http://www.adesso.us:80/product_details.asp?dept_id=106&pf_id=KA33ACK-540",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/browse.aspx",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/default.aspx",
            "https://web.archive.org/web/20030507032656/http://www.adesso.us:80/product_details.asp?dept_id=106&pf_id=KA33ACK-540PB"
        ],
        "title": "Adesso ACK-540PB PS/2 Mini PS/2 Touchpad Keyboard",
        "company": "Adesso",
        "year": 2003,
        "primaryKey": "Keyboard",
        "secondaryKey": "Touchpad",
        "attribute": "Blank",
        "originalPrice": 69.95,
        "degreesOfFreedom": 2,
        "dimensions": {
            "dim_length": 287,
            "dim_width": 140,
            "dim_height": 35.5,
            "dim_unit": "mm"
        },
        "shortDescription": "The Mini-Touch Keyboard is a small-footprint keyboard with a centrally mounted touchpad. It initially was released with a PS/2 connector, and then in 2006 the connector was updated to USB. While keyboards with integrated touchpads had been available since the mid-1980s, small-footprint ones with centrally mounted touch pads were far less common.",
        "longDescription": "Released in 2003, this is a small add-on keyboard with an integrated touchpad. While there had been keyboards released with touchpads earlier – see the 1985 KeyTronic LT Touchpad Keyboard in the collection, for example – these were full-sized keyboard, typically with the touchpad mounted at the side, rather than the middle. Keyboards such as the Adesso ACK-540PB, were styled after the smaller foot-print keyboards then becoming standard on laptops, in terms of the central placement of the touchpad, as well as size. This central placement was significant, since it gave equal access to either right or left hand. The touchpad used was a Glidepoint, a 1994 stand-alone version of which is in the collection, the 1994 Cirque Glidepoint. This first model of the ACK-540 was released in both black (ACK-540PB) and white (ACK-540PW) and came with a PS/2 connector. In 2006, black and white versions updated with a USB connectors were released (the ACK-540UB and ACK-540UW) were released – an indication that the product had sustained a place in the market. These same keyboards were also marketed under different brand names, including SolidTek and Daltaco.",
        "__images": [
            "http://localhost:1050/files/images/buxton/upload_1630ce95-2c9c-48cb-bf9c-fcfd2ac2333c.jpg",
            "http://localhost:1050/files/images/buxton/upload_96d02e55-06fa-44b9-8716-9fdecb777baa.jpg",
            "http://localhost:1050/files/images/buxton/upload_4dc14dd0-0fe9-45f7-bc58-f2f4ee226f48.jpg",
            "http://localhost:1050/files/images/buxton/upload_b275338e-077f-408e-9b88-93f56092a53f.jpg",
            "http://localhost:1050/files/images/buxton/upload_22f121b9-9df8-4073-a620-28f8792591c7.jpg"
        ],
        "captions": [
            "Top view of the Adesso Mini-Touch Keyboard with Touchpad.",
            "Side view of the Adesso Mini-Touch Keyboard with Touchpad.",
            "Adesso 2003 product web page for the black 540_PB model of the Mini Touchpad Keyboard.",
            "Adesso 2003 product web page for the white 540_PW model of the Mini Touchpad Keyboard"
        ],
        "fileNames": [
            "Adesso_540_Top.JPG",
            "Adesso_540_Side.JPG",
            "Adesso_ACK-540PB_May_7_2003.jpg",
            "Adesso_ACK-540PW_June 21_2003.jpg"
        ]
    },
    {
        "hyperlinks": [
            "https://web.archive.org/web/20070902035057/http://www.adesso.com/new_arrival.asp",
            "Adesso_KP_Mouse_11_Product.pdf",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/default.aspx",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/contact.aspx",
            "Adesso_KP_Mouse_10.pdf",
            "http://www.notebookreview.com/review/adesso-usb-numeric-keypad-and-optical-mouse-review/",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/acknowledgements.aspx",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/browse.aspx",
            "https://web.archive.org/web/20071025131401/http://www.adesso.com/products_detail.asp?productid=363",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/default.aspx"
        ],
        "title": "Adesso 2-in-1 Optical Keypad Calculator Mouse AKP-170",
        "company": "Adesso Inc",
        "year": 2007,
        "primaryKey": "Mouse",
        "secondaryKey": "Keypad",
        "attribute": "",
        "originalPrice": 29.99,
        "degreesOfFreedom": 3,
        "dimensions": {
            "dim_length": 120.7,
            "dim_width": 57.15,
            "dim_height": 38.1,
            "dim_unit": "mm"
        },
        "shortDescription": "This is a mouse / keypad hybrid. With the transparent hinged cover down, it functions like a conventional scroll-wheel optical mouse. All the while, its additional capability as a numerical keypad / calculator is visible, and physically accessed by flipping up the cover. Since the design affords access to the mouse buttons and scroll wheel with the lid open, the opportunity to select cells in a spreadsheet, for example, and enter numbers without moving between the traditional keyboard and mouse is provided.",
        "longDescription": "This is a mouse / numerical keypad hybrid. With the transparent hinged cover down, it functions like a conventional scroll-wheel optical mouse. All the while, its additional capability as a numerical keypad / calculator is visible, and physically accessed by flipping up the cover. Since the design affords access to the mouse buttons and scroll wheel with the lid open, the opportunity to select cells in a spreadsheet, for example, and enter numbers without moving between the traditional keyboard and mouse is provided. There are a few mice with integrated keypads included in the collection. Each takes a different approach in terms of intent as well as industrial design. Comparing them is a worthwhile exercise. By the same token, the approach taken by this example echoes that taken by a very different product, but with the same intent: layer complexity. In this case the president from the collection is a TV/VCR remote control: the 1990 Sony RMT-V5A. For comparison, see the accompanying photo, and for more information, look at the Sony’s detailed device description. Finally, in drawing attention to this specific example rather than one of the hybrid mouse/keypads referred to earlier, the intent is to show that inspiration for design solutions for one class of device can come from those of very different categories. For sure, look at previous in-class solutions. But that just puts you on par with most other designers. The best exercise their creativity by looking in far less explored places. Note to the sharp eyed: If you look at the bottom of the mouse, you will see it marked model KM-1411, while I have been referring to it, as well as the Adesso Web Site, as model AKP-170. Rest assured, these are the same thing, as can be seen on the bottom right corner of the back of the box, where both numbers appear. I too am confused as to why, but also reassured. .",
        "__images": [
            "http://localhost:1050/files/images/buxton/upload_4779cb76-f8ad-43ee-9889-ec5bfd81b91c.jpg",
            "http://localhost:1050/files/images/buxton/upload_41dd15ea-dc1f-4e1a-b2cb-c57287e9f952.jpg",
            "http://localhost:1050/files/images/buxton/upload_be3fd29a-0e23-4f28-9ef5-d17a55eb6df7.jpg",
            "http://localhost:1050/files/images/buxton/upload_6737b99b-4ec8-4147-8a61-28dcb66d84e5.jpg",
            "http://localhost:1050/files/images/buxton/upload_83fe9d52-d8f1-453c-9f0b-31f12733fb9d.jpg",
            "http://localhost:1050/files/images/buxton/upload_f896e2d4-7324-4b13-9ff6-805d7d01ef10.jpg",
            "http://localhost:1050/files/images/buxton/upload_b60815b2-1d4b-487e-ab3f-a7a13f75646e.jpg",
            "http://localhost:1050/files/images/buxton/upload_6bbc0a3b-bcb0-4107-99e6-b0e26d9082b8.jpg",
            "http://localhost:1050/files/images/buxton/upload_887a5178-01b5-4b56-9acf-428b76ebe338.jpg",
            "http://localhost:1050/files/images/buxton/upload_ad8f6939-0edb-4286-8bf1-0fb24bff53a0.jpg",
            "http://localhost:1050/files/images/buxton/upload_e04e3054-7480-4563-8b37-1b1239b04c3b.jpg"
        ],
        "captions": [
            "An overview of the Adesso AKP-170 Mouse with the transparent hinged keypad cover open.  Note that the mouse controls can still be accessed.",
            "The Adesso AKP-170 Mouse with the transparent hinged keypad cover in its default closed position.",
            "The 1990 Sony RMT-V5A Space Control.  Note how the hinged cover of the Adesso mouse echoes this design.  Stepping outside of one’s product class can provide a rich source of relevant ideas.",
            "A view of the Adesso AKP-170 Mouse from the upper left side.",
            "A front-end view of the Adesso AKP-170 Mouse.",
            "A view of the bottom of the Adesso AKP-170 Mouse, showing serial number, etc.",
            "A front view of the Adesso AKP-170 Mouse in its original box.",
            "A back-side view of the original box for the Adesso AKP-170 Mouse.",
            "1-page user manual for the Adesso AKP-170 Mouse.",
            "Page 1 of a review of the Adesso AKP-170 from the Dec. 2007 Notebook Review web page.  (Click on image to access full document.)",
            "First page of Adesso Oct. 25, 2007 Product Web Page for the AKP-170 Mouse.(Click on image to access full document.)"
        ],
        "fileNames": [
            "Adesso_KP_Mouse_01.JPG",
            "Adesso_KP_Mouse_02.JPG",
            "Adesso_KP_Mouse_03.JPG",
            "Adesso_KP_Mouse_04.JPG",
            "Adesso_KP_Mouse_05.JPG",
            "Adesso_KP_Mouse_06.JPG",
            "Adesso_KP_Mouse_07.JPG",
            "Adesso_KP_Mouse_08.JPG",
            "Adesso_KP_Mouse_09.JPG",
            "Adesso_KP_Mouse_10.JPG",
            "Adesso_KP_Mouse_11_Product.JPG"
        ]
    },
    {
        "hyperlinks": [
            "https://web.archive.org/web/20051210101548/http://www.a4tech.com/en/product1.asp?CID=90&SCID=92",
            "http://a4tech.com/product.asp?cid=142&scid=122&id=342",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/default.aspx",
            "https://microsoft-my.sharepoint.com/personal/bibuxton_microsoft_com/Documents/Buxton%20Collection/Collection/To%20Shoot/A4_Tech_NB-75D%20Mouse/NB75D_Mouse_Manual.pdf",
            "http://www.ubergizmo.com/2007/11/a4tech-battery-free-wireless-mouse/",
            "BATTERYfree_Mouse_Data_Sheet.pdf",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/contact.aspx",
            "https://web.archive.org/web/20060707175129/http://ergoshops.com:80/store.asp?CID=200209271427192&SCID=200410281216151",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/acknowledgements.aspx",
            "NB75D_Mouse_Manual.pdf",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/browse.aspx",
            "https://web.archive.org/web/20060211161019/http://www.a4tech.com/en/product2.asp?CID=90&SCID=92&MNO=NB-75",
            "http://research.microsoft.com/en-us/um/people/bibuxton/buxtoncollection/default.aspx"
        ],
        "title": "A4 Tech BatteryFREE Wireless Optical Mouse Model NB-75D",
        "company": "A4Tech",
        "year": 2005,
        "primaryKey": "Mouse",
        "secondaryKey": "Scroll-wheel",
        "attribute": "Blank",
        "originalPrice": 35.99,
        "degreesOfFreedom": 4,
        "shortDescription": "This is a little-known innovative mouse worth study. It is one of the first to have wireless charging – by sitting on its mouse pad. It has two scroll wheels which are mounted at right angles – like an Etch-a-Sketch, to conform to the direction to be scrolled (up/down vs left/right. It also has a dedicated button which “double clicks” with one push.",
        "longDescription": "This mouse fell below the radar, and yet it had remarkable innovations in its design, especially given its price. Like any mouse, it provided 2 degrees of freedom for pointing. Unlike most scroll-wheel mouse, it had two separate scroll wheels mounted at right angles. Hence, the orientation of each wheel provided a cue as to which direction the affected document would scroll – up/down or left/right. It is interesting to consider this scroll-wheel layout with that on a companion mouse, the A4 Tech Model IRW-5 4D Wireless Mouse, also in the collection, and shown side-by-side in one of the accompanying photographs. While the scroll wheels of the NF-75 are at right angles, those of the IRW-5 are parallel. Such differences should always provoke the question “Why? ” – for would-be designer and consumer alike. As a memory aid, and the conform to what psychologists call “stimulus-response (S: -R) compatibility”, the right-angle arrangement seems to be far better mapping of action to effect. On the other hand, try an experiment. First, place your hand, palm facing down, on a desktop as if you were holding a mouse. All fingers and thumb should be touching the desktop, but not your palm. Maintaining that position, left your index (scrolling) finger, and repeatedly “fold” and “unfold” it between a pointing posture, and touching your palm. Next, keeping your hand in the same position, this time, again extend your index finger. But this time, move its tip back-and-forth in a left-right motion. What I hope you quickly perceive is that the finger was “optimized” for the folding rather than lateral motion. You “feel” that from the difference in tension in the hand in the two cases of the “study”. The two conditions of our “quick” study roughly mimic the motor actions required to operate the scroll wheels. Since the brief test suggests the possibility that repeated lateral movement may accelerate the onset of repetitive stress injury, it would therefore also suggest that further studies should be undertaken before using a left-right scroll wheel – despite the acknowledged advantage with respect to S: R compatibility. In addition to the select button on virtually all mice, there was an additional button which issued a double-click on a single push. Hence, clicking one button would select, while pushing the other would select and open. While for many, the cost of an extra button may not seem worth saving the effort of a double click, those with some motor impairment may disagree. This is an example where knowing about such things may trigger useful insights to improve future designs. However, perhaps the biggest innovation with this line of A4 mice is that they were powered wirelessly. That is, there were no batteries in the mouse that might die at the wrong moment. Power was provided wirelessly from the mouse pad. Yet, one again we see that design is full of trade-offs. The cost of providing this feature is that of requiring not just the mouse pad, but a special one – something not overly attractive to road-warriors whose brief-cases were already weighted down by cables and other paraphernalia which took up more space than the laptop itself. .",
        "__images": [
            "http://localhost:1050/files/images/buxton/upload_b67492f2-7aa9-4ba2-91b7-4f14f41c7826.jpg",
            "http://localhost:1050/files/images/buxton/upload_a9aa525c-5792-47bf-86bf-d4ed886f64a8.jpg",
            "http://localhost:1050/files/images/buxton/upload_44f0c2a8-7764-47e0-9bd9-ef6ea370ac84.jpg",
            "http://localhost:1050/files/images/buxton/upload_03e69dd3-c71b-41ae-ac46-bf7a10f71e9f.jpg",
            "http://localhost:1050/files/images/buxton/upload_99d050c1-be2e-48ef-ab06-3c09ea015bab.jpg",
            "http://localhost:1050/files/images/buxton/upload_df319bc0-0796-4c3f-947d-60894d54e77f.jpg",
            "http://localhost:1050/files/images/buxton/upload_ed972377-d5b4-430b-829b-8af13f9f834f.jpg",
            "http://localhost:1050/files/images/buxton/upload_7fbb9ffe-389f-41e6-834d-0fd2fd76524f.jpg",
            "http://localhost:1050/files/images/buxton/upload_4cc3509f-402f-4c15-9e49-88cc31c72ec3.jpg",
            "http://localhost:1050/files/images/buxton/upload_e5579c14-0d43-48f0-9c0c-0928032399ad.jpg",
            "http://localhost:1050/files/images/buxton/upload_b77c46ea-0626-4622-bf63-9ed851cf5690.jpg",
            "http://localhost:1050/files/images/buxton/upload_3d80d10e-f787-4a7f-bd99-1ce7e2c10161.jpg"
        ],
        "captions": [
            "The A4 Tech Model NB-75D optical mouse on its charging mouse pad.",
            "Front view of the A4 Tech NB-75D mouse beside its A4 Tech IRW-5 4D companion. Note the difference in the second scroll-wheel.  See text for discussion.",
            "Top view of the A4 Tech NB-75D mouse beside its A4 Tech IRW-5 4D companion.",
            "Upper front quarter view of the A4 Tech Model NB-75D optical mouse.",
            "Front view of the A4 Tech Model NB-75D optical mouse.",
            "Upper rear-quarter view of the A4 Tech Model NB-75D optical mouse.",
            "Top view of the A4 Tech Model NB-75D optical mouse.",
            "The A4 Tech Model NB-75D optical mouse on its charging mouse pad, showing the mouse pad USB connector.",
            "The A4 Tech Model NB-75D product web page.",
            "Front page of Jandata sheet for the A4 BATTERYfree optical mouse product line. From A4 Tech web site.",
            "The A4 Tech Model NB-75D User’s Guide.(Click on image to access full document.)"
        ],
        "fileNames": [
            "NB75D_IMG_0682.JPG",
            "NB75D_IMG_0666.JPG",
            "NB75D_IMG_0676.JPG",
            "NB75D_IMG_0671.JPG",
            "NB75D_IMG_0672.JPG",
            "NB75D_IMG_0673.JPG",
            "NB75D_IMG_0679.JPG",
            "NB75D_IMG_2016.JPG",
            "NB75D_Product_Page.jpg",
            "BATTERYfree_Mouse_Data_Sheet.jpg",
            "NB75D_Mouse_Manual.jpg"
        ]
    }
]